// void 함수를 사용해 인사말을 출력하는 프로그램
//#include <iostream>
//using namespace std;
//
///*******************************************************************
// * greeting 함수 정의, greeting 함수는 매개변수가 없는 void 함수   *
// * 세 줄의 메시지를 출력하기 위해 생성                             *
// * 아무것도 리턴하지 않지만,                                      *
// * 화면에 메시지를 출력하는 부가 작용을 갖고 있음                  *
// *******************************************************************/
//void greeting()
//{
//	cout << "*******************" << endl;
//	cout << "* 안녕하세요!     *" << endl;
//	cout << "*******************";
//	return;
//}
//
//int main()
//{
//	greeting();   // greeting 함수 호출 
//	return 0;
//}